<?php
    $obj = [
        "0" => [
            "name" => "แท่งทองแดงยุคสุโขทัย",
            "keyword" => ["แดง","กระบอก","แท่ง"],
            "match" => 0,
        ],
        "1" => [
            "name" => "ดาบทองแดงโบราณ",
            "keyword" => ["ทองแดง","แหลมคม","เงา","แดง","โลหะ"],
            "match" => 0,
        ],
        "2" => [
            "name" => "กระบองทองแดงโบราณ",
            "keyword" => ["ทองแดง","เงา","แดง","โลหะ","ทื่อ","หนัก"],
            "match" => 0,
        ],
        "3" => [
            "name" => "ไหดินเผายุคสำริด",
            "keyword" => ["ไห","ดินเผา","สำริด"],
            "match" => 0,
        ],
    ];

    echo json_encode($obj);
?>