<?php
    $obj = [
        "0" => [
            "key" => "แดง",
            "ref" => ["ชาด","โลหิต"],
        ],
        "1" => [
            "key" => "ชาด",
            "ref" => ["แดง","โลหิต"],
        ],
        "2" => [
            "key" => "โลหิต",
            "ref" => ["เลือด","แดง"],
        ],
        "3" => [
            "key" => "แหลมคม",
            "ref" => ["ปลายแหลม","เงา","แท่ง"],
        ],
        "4" => [
            "key" => "เงา",
            "ref" => ["สะท้อนแสง","แหลมคม"],
        ],
        "5" => [
            "key" => "ทองแดง",
            "ref" => ["แดง","โลหะ","มันวาว"],
        ],
        "6" => [
            "key" => "โลหะ",
            "ref" => ["แข็งแรง","แหลมคม"],
        ],
        "7" => [
            "key" => "ไห",
            "ref" => ["ดินเผา","เครื่องปั้น"],
        ],
        "8" => [
            "key" => "ทื่อ",
            "ref" => ["ไม่แหลมคม","หนัก"],
        ],
    ];

    echo json_encode($obj);
?>